20210905195215-postgresql.org
:PROPERTIES:
:ID:       752d725e-b834-4784-8110-c58f89bd4fa2
:mtime:    20241102180354
:ctime:    20210905195215
:END:
#+title: PostgreSQL
* 概要
RDBMSの1つ。[[id:7dab097c-60ba-43b9-949f-c58bf3151aa8][MySQL]]と競合している。
* Memo
** 基本コマンド

#+begin_src shell
  データベース一覧の表示
  \l

  データベースの選択
  \c データベース名

  テーブル一覧の表示
  \dt;

  テーブル構造の表示
  \d テーブル名;
#+end_src

- [[https://qiita.com/H-A-L/items/fe8cb0e0ee0041ff3ceb][PostgreSQLの基本的なコマンド - Qiita]]
** 起動
データベースサーバを起動する必要がある。
#+begin_src shell
sudo service postgresql start
sudo service postgresql stop
#+end_src

起動せずにpsqlすると↓エラー出る。
#+begin_quote
psql: error: could not connect to server: No such file or directory
        Is the server running locally and accepting
        connections on Unix domain socket "/var/run/postgresql/.s.PGSQL.5432"?
#+end_quote
* Tasks
* Reference
** [[https://speakerdeck.com/soudai/postgresql-architecture-and-performance-monitoring][PostgreSQL Architecture And Performance Monitoring - Speaker Deck]]
:LOGBOOK:
CLOCK: [2023-07-30 Sun 21:41]--[2023-07-30 Sun 22:06] =>  0:25
:END:
PostgreSQLの内部構造と監視の解説。
* Archives
