20210905195215-postgresql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PostgreSQL</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">PostgreSQL</h1>
<div id="outline-container-org743b4df" class="outline-2">
<h2 id="org743b4df"><a href="#org743b4df">概要</a></h2>
<div class="outline-text-2" id="text-org743b4df">
<p>
RDBMSの1つ。<a href="20210829232020-mysql.html#ID-7dab097c-60ba-43b9-949f-c58bf3151aa8">MySQL</a>と競合している。
</p>
</div>
</div>
<div id="outline-container-org0b36cb0" class="outline-2">
<h2 id="org0b36cb0"><a href="#org0b36cb0">Memo</a></h2>
<div class="outline-text-2" id="text-org0b36cb0">
</div>
<div id="outline-container-org88a995a" class="outline-3">
<h3 id="org88a995a"><a href="#org88a995a">基本コマンド</a></h3>
<div class="outline-text-3" id="text-org88a995a">
<div class="org-src-container">
<pre class="src src-shell">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#19968;&#35239;&#12398;&#34920;&#31034;
\l

&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#36984;&#25246;
\c &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;

&#12486;&#12540;&#12502;&#12523;&#19968;&#35239;&#12398;&#34920;&#31034;
\dt;

&#12486;&#12540;&#12502;&#12523;&#27083;&#36896;&#12398;&#34920;&#31034;
\d &#12486;&#12540;&#12502;&#12523;&#21517;;
</pre>
</div>

<ul class="org-ul">
<li><a href="https://qiita.com/H-A-L/items/fe8cb0e0ee0041ff3ceb">PostgreSQLの基本的なコマンド - Qiita</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgce5dc9d" class="outline-3">
<h3 id="orgce5dc9d"><a href="#orgce5dc9d">起動</a></h3>
<div class="outline-text-3" id="text-orgce5dc9d">
<p>
データベースサーバを起動する必要がある。
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo service postgresql start
sudo service postgresql stop
</pre>
</div>

<p>
起動せずにpsqlすると↓エラー出る。
</p>
<blockquote>
<p>
psql: error: could not connect to server: No such file or directory
        Is the server running locally and accepting
        connections on Unix domain socket &ldquo;<i>var/run/postgresql</i>.s.PGSQL.5432&rdquo;?
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgbf02faa" class="outline-2">
<h2 id="orgbf02faa"><a href="#orgbf02faa">Tasks</a></h2>
</div>
<div id="outline-container-org05be940" class="outline-2">
<h2 id="org05be940"><a href="#org05be940">Reference</a></h2>
<div class="outline-text-2" id="text-org05be940">
</div>
<div id="outline-container-org20d2851" class="outline-3">
<h3 id="org20d2851"><a href="#org20d2851"><a href="https://speakerdeck.com/soudai/postgresql-architecture-and-performance-monitoring">PostgreSQL Architecture And Performance Monitoring - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-org20d2851">
<p>
PostgreSQLの内部構造と監視の解説。
</p>
</div>
</div>
</div>
<div id="outline-container-orgd36e09a" class="outline-2">
<h2 id="orgd36e09a"><a href="#orgd36e09a">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
